In [1]:
import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/harissriramoju/DataScience-Samples/master/gapminder.tsv", sep = '\t')

In [2]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [3]:
df.shape

(1704, 6)

In [6]:
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [7]:
df.year.unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [9]:
df.loc[df.year == 1952, :]['lifeExp'].mean()

49.05761971830987

In [10]:
df.groupby('year')['lifeExp'].describe()

      count       mean        std     min       25%      50%       75%     max
year
1952  142.0  49.057620  12.225956  28.801  39.05900  45.1355  59.76500  72.670
1957  142.0  51.507401  12.231286  30.332  41.24750  48.3605  63.03675  73.470
1962  142.0  53.609249  12.097245  31.997  43.46850  50.8810  65.23450  73.680
1967  142.0  55.678290  11.718858  34.020  46.03375  53.8250  67.41950  74.160
1972  142.0  57.647386  11.381953  35.400  48.50025  56.5300  69.24750  74.720
1977  142.0  59.570157  11.227229  31.220  50.47550  59.6720  70.38250  76.110
1982  142.0  61.533197  10.770618  38.445  52.94000  62.4415  70.92125  77.110
1987  142.0  63.212613  10.556285  39.906  54.94075  65.8340  71.87725  78.670
1992  142.0  64.160338  11.227380  23.599  56.12175  67.7030  72.58250  79.360
1997  142.0  65.014676  11.559439  36.087  55.63375  69.3940  74.16975  80.690
2002  142.0  65.694923  12.279823  39.193  55.52225  70.8255  75.45925  82.000
2007  142.0  67.007423  12.073021  39.613  57.16025  71.9355  76.41325  82.603

In [14]:
'''
    count : Frequency count not including NaN values : np.count_nonzero()
    size: Frequency count with NaN values
    mean: np.mean
    min: np.min
    median:
    max:
    quantile(q = 0.25) : np.percentile(q = 0.50)
    sum
    std
    var
    sem (standard error of the mean) : scipy.stats.sem
    describe : scipy.stats.describe
    mode
    first : first row informaiton
    last : last row information
    
'''

'\n    count :\n    size:\n    mean:\n    min:\n    median:\n    max:\n    quantile(q = 0.25)\n    sum\n    std\n    var\n    sem (standard error of the mean)\n'

In [15]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [17]:
df.groupby('continent')['lifeExp'].quantile(q= 0.50)

continent
Africa      47.7920
Americas    67.0480
Asia        61.7915
Europe      72.2410
Oceania     73.6650
Name: lifeExp, dtype: float64

In [18]:
import numpy as np
df.groupby('year')['lifeExp'].agg(np.mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [19]:
def custom_mean(values):
    sum_ =0;
    for each in values:
        sum_ += each;
    return sum_/len(values);

In [21]:
df.groupby('year')['lifeExp'].aggregate(custom_mean)

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [22]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [23]:
df.shape

(1704, 6)

In [26]:
global_mean = df.lifeExp.mean() # global average of the lifeExp

In [27]:
def mean_diff(vec, global_mean):
    sum_ = 0;
    for each in vec:
        sum_ += each;
    avg = sum_/len(vec)
    
    return global_mean - avg;

In [28]:
df.groupby('year')['lifeExp'].agg(mean_diff, global_mean = global_mean)

year
1952    10.416820
1957     7.967038
1962     5.865190
1967     3.796150
1972     1.827053
1977    -0.095718
1982    -2.058758
1987    -3.738173
1992    -4.685899
1997    -5.540237
2002    -6.220483
2007    -7.532983
Name: lifeExp, dtype: float64

In [29]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [30]:
df.groupby('year')['lifeExp'].aggregate([np.count_nonzero, np.mean, np.var])

      count_nonzero       mean         var
year
1952          142.0  49.057620  149.473995
1957          142.0  51.507401  149.604360
1962          142.0  53.609249  146.343337
1967          142.0  55.678290  137.331628
1972          142.0  57.647386  129.548857
1977          142.0  59.570157  126.050680
1982          142.0  61.533197  116.006208
1987          142.0  63.212613  111.435157
1992          142.0  64.160338  126.054051
1997          142.0  65.014676  133.620631
2002          142.0  65.694923  150.794046
2007          142.0  67.007423  145.757824

In [31]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [44]:
df.groupby('year').agg({'lifeExp': np.mean, 'pop': custom_mean, 'gdpPercap': np.std })

        lifeExp           pop     gdpPercap
year
1952  49.057620  1.695040e+07   9321.064786
1957  51.507401  1.876341e+07   9869.662202
1962  53.609249  2.042101e+07   8667.362525
1967  55.678290  2.265830e+07   8095.315431
1972  57.647386  2.518998e+07  10614.383403
1977  59.570157  2.767638e+07   8362.489150
1982  61.533197  3.020730e+07   7733.845006
1987  63.212613  3.303857e+07   8288.281304
1992  64.160338  3.599092e+07   9031.846080
1997  65.014676  3.883947e+07  10171.493263
2002  65.694923  4.145759e+07  11154.114865
2007  67.007423  4.402122e+07  12859.937337

In [45]:
import seaborn as sns

In [46]:
df = sns.load_dataset("tips")

In [47]:
df.shape

(244, 7)

In [50]:
tips_10 = df.sample(10, random_state = 42)

In [51]:
tips_10

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [52]:
tips_10.loc[np.random.permutation(tips_10.index)[:4], 'total_bill'] = np.NaN

In [53]:
tips_10

     total_bill   tip     sex smoker   day    time  size
24          NaN  3.18    Male     No   Sat  Dinner     2
6           NaN  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211         NaN  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101         NaN  3.00  Female    Yes   Fri  Dinner     2

In [54]:
tips_10.groupby('sex').count()

        total_bill  tip  smoker  day  time  size
sex
Male             4    7       7    7     7     7
Female           2    3       3    3     3     3

In [55]:
tips_10.groupby('sex')['total_bill'].mean()

sex
Male      21.415
Female    12.740
Name: total_bill, dtype: float64

In [56]:
# transform function which also takes a function as an argument

'''
When we tranform data, we pass values from dataframe into a function. The function transform the data. Unlike aggregate,
which takes multiple values and return a single (aggregate )value, transform takes multiple values and return one-o-one 
transformation of the values... That is, it doesn't reduce the amount of data. 

'''

"\nWhen we tranform data, we pass values from dataframe into a function. The function transform the data. Unlike aggregate,\nwhich takes multiple values and return a single (aggregate )value, transform takes multiple values and return one-o-one \ntransformation of the values... That is, it doesn't reduce the amount of data. \n\n"

In [57]:
def replace_mean(vec):
    avg = vec.mean()
    
    return vec.fillna(avg)

In [61]:
tips_10.groupby('sex')['total_bill'].transform(replace_mean)

24     21.415
6      21.415
153    24.550
211    21.415
198    13.000
176    17.890
192    28.440
124    12.480
9      14.780
101    12.740
Name: total_bill, dtype: float64

In [63]:
tips_10

     total_bill   tip     sex smoker   day    time  size
24          NaN  3.18    Male     No   Sat  Dinner     2
6           NaN  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211         NaN  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101         NaN  3.00  Female    Yes   Fri  Dinner     2

In [64]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [65]:
df.shape

(244, 7)

In [68]:
df['size'].value_counts()

2    156
3     38
4     37
5      5
1      4
6      4
Name: size, dtype: int64

In [71]:
t = df.groupby('size').filter(lambda x : x['size'].count() >=30)

In [73]:
t['size'].value_counts()

2    156
3     38
4     37
Name: size, dtype: int64

In [74]:
df.shape

(244, 7)

In [75]:
tips_10 = df.sample(10, random_state = 42)

In [76]:
tips_10

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [77]:
g = tips_10.groupby('sex')

In [78]:
g

In [79]:
g.groups

{'Male': [24, 6, 153, 211, 176, 192, 9], 'Female': [198, 124, 101]}

In [80]:
g.mean()

        total_bill       tip      size
sex
Male         20.02  2.875714  2.571429
Female       13.62  2.506667  2.000000

In [82]:
s = tips_10.groupby('sex')['total_bill']

In [83]:
s.groups

{'Male': [24, 6, 153, 211, 176, 192, 9], 'Female': [198, 124, 101]}

In [84]:
s.mean()

sex
Male      20.02
Female    13.62
Name: total_bill, dtype: float64

In [85]:
g

In [86]:
for each in g:
    print (each)

('Male',      total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2)
('Female',      total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2)

In [91]:
for each in g:
    print ("Type of the object : {}".format(type(each)))
    print ("Length of the object : {}".format(len(each)))
    print ("First elment in tuple : {}".format(each[0]))
    print ("Second element is : {}".format(type(each[1])))

Type of the object : <class 'tuple'>
Length of the object : 2
First elment in tuple : Male
Second element is : <class 'pandas.core.frame.DataFrame'>
Type of the object : <class 'tuple'>
Length of the object : 2
First elment in tuple : Female
Second element is : <class 'pandas.core.frame.DataFrame'>